FemDesign.Geometry.Region
region_type
Surfaces in FEM-Design are expressed as regions of contours (outlines). This extended region also contains a LCS to keep track of directions.

FemDesign.Geometry.Region.LocalZ
Used for panels and sections

FemDesign.Geometry.Region.#ctor
Parameterless constructor for serialization.

FemDesign.Geometry.Region.#ctor(System.Collections.Generic.List{FemDesign.Geometry.Point3d},FemDesign.Geometry.CoordinateSystem)
Create region by points and coordinate system.
points: List of sorted points defining the outer perimeter of the region.
coordinateSystem: Coordinate system of the region

FemDesign.Geometry.Region.Reverse
Reverse the contours in this region

FemDesign.Geometry.Region.FromSlab(FemDesign.Shells.Slab)
Get region from a Slab.

FemDesign.Geometry.Region.SetEdgeConnection(FemDesign.Shells.EdgeConnection,System.Int32)
Set EdgeConnection on Edge in region by index.

FemDesign.Geometry.Region.SetEdgeConnections(FemDesign.Shells.EdgeConnection)
Set EdgeConnection on all Edges in Region.

FemDesign.Geometry.Region.GetEdgeConnections
Get all EdgeConnection from all Edges in Region.

FemDesign.Geometry.Region.GetPredefinedRigidities
Get all PredefinedRigidities from all Edges in Region
Returns:

FemDesign.Geometry.Region.SetPredefinedRigidities(System.Collections.Generic.List{FemDesign.Releases.RigidityDataLibType3})
Set line connection types (i.e predefined line connection type) on region edges

FemDesign.Geometry.Region.RemoveEdgeConnections
Returns a new instance of region, without any EdgeConnections.
Returns: